using System;

namespace задание_2
{
    class Program
    {
        static void Main()
        {
            Шасси авто = new Шасси(0, 0, 9.9, 0, "***", "***", 9.9, 9.9, true, "***");
            Console.WriteLine("--------------------------------------\nавто");
            авто.Text();

            Шасси грузовик = new Шасси(1, 1, 1.1, 1, "+++", "+++", 1.1, 1.1, false, "+++");
            Console.WriteLine("--------------------------------------\nгрузовик");
            грузовик.Text();

            Шасси автобус = new Шасси(2, 2, 2.2, 2, "---", "---", 2.2, 2.2, true, "---");
            Console.WriteLine("--------------------------------------\nавтобус");
            автобус.Text();

            Шасси Скутер = new Шасси(3, 3, 3.3, 3, "000", "000", 3.3, 3.3, false, "000");
            Console.WriteLine("--------------------------------------\nСкутер");
            Скутер.Text();
        }
    }
}